import random
import time

# نمایش پیام خوش‌آمدگویی به بازی
print('<<----به بازی حدس عدد خوش آمدید---->>')
time.sleep(3)

# اطلاع‌رسانی به کاربر در مورد بازه عدد مورد نظر برای حدس زدن
print('<<---بین 1 تا 100--->>')
time.sleep(2)

# گرفتن نام کاربر
name = input('نام شما چیست؟ ')
time.sleep(1)

# دریافت حدس اولیه از کاربر
guess = int(input('حدس شما چیست؟: '))

# انتخاب تصادفی عدد درست بین ۱ تا ۱۰۰
answer = random.randint(1, 100)

# مقداردهی اولیه شمارنده تعداد حدس‌ها
guess_count = 0

# تکرار تا زمانی که حدس کاربر با جواب یکسان شود
while guess != answer:
    time.sleep(0.5)
    guess_count += 1
    
    # اگر حدس کاربر بزرگتر از جواب باشد، پیام متناسب نمایش داده و حدس جدید درخواست می‌شود
    if guess > answer:
        guess = int(input('حدس شما بزرگتر است. حدس بعدی شما چیست؟: '))
        
    # اگر حدس کاربر کوچکتر از جواب باشد، پیام متناسب نمایش داده و حدس جدید درخواست می‌شود
    else:
        guess = int(input('حدس شما کوچکتر است. حدس بعدی شما چیست؟: '))

# نمایش پیام تبریک به کاربر و نشان دادن عدد درست و تعداد حدس‌ها
print(f'تبریک {name}! عدد درست {answer} بود. شما {guess_count} حدس زدید.')
